-- CHUN 05. DML - 함수
-- YOON : 1, 2

--------------------------------------------------------------------------------
-- 1. 과목유형 테이블(TB_CLASS_TYPE)에 아래와 같은 데이터를 입력하시오. 
-- 번호 , 유형이름
--  01  , 전공필수
--  02  , 전공선택
--  03  , 교양필수
--  04  , 교양선택
--  05  , 논문지도
--------------------------------------------------------------------------------
INSERT INTO TB_CLASS_TYPE VALUES(01, '전공필수');
INSERT INTO TB_CLASS_TYPE VALUES(02, '전공선택');
INSERT INTO TB_CLASS_TYPE VALUES(03, '교양필수');
INSERT INTO TB_CLASS_TYPE VALUES(04, '교양선택');
INSERT INTO TB_CLASS_TYPE VALUES(05, '논문지도');
COMMIT;
DESC TB_CLASS_TYPE;
--------------------------------------------------------------------------------
-- 2. 춘 기술대학교 학생들의 정보가 포함되어있는 학생일반정보 테이블을 만들고자 한다. 
-- 아래 내용을 참고하여 적적한 SQL문을 작성하시오.(서브쿼리를 이용하시오)
--------------------------------------------------------------------------------
CREATE TABLE TB_학생일반정보
AS SELECT 
STUDENT_NO"학번", 
STUDENT_NAME"이름", 
STUDENT_ADDRESS"주소"
FROM TB_STUDENT;